Revit 2027 API
FamilyInstance.GetCopingIds Method
Lists the elements currently used as coping cutters for this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetCopingIds()
Public Function GetCopingIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetCopingIds()
member GetCopingIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The coping ElementIds
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace